# DATA PREPROCESSING

In [2]:
import numpy as np
import pandas as pd
import sqlite3

### READING DATABASE TABLES

In [3]:
conn=sqlite3.connect(r'E:\DataBase\Results.db')

In [4]:
dataDB=pd.read_sql_query('select * from Student_1_Marks',conn)

In [5]:
dataDB

   SL_NO     Subject  Marks Grade
0      1       Maths     98     O
1      2     English     80     E
2      3       Hindi     88     E
3      4    Computer     96     O
4      5  Hist & Geo     83     E
5      6     Science     85     E

In [27]:
dataDB2=pd.read_sql_query('select * from Student_2_Marks',conn)
dataDB2

   SL_NO     Subject  Marks Grade
0      1       Maths     99     O
1      2     English     92     O
2      3       Hindi     76     A
3      4    Computer     90     O
4      5  Hist & Geo     78     A
5      6     Science     80     E

In [21]:
data1=pd.read_sql_query('select * from Student_1_Marks where Marks>90',conn)
data1

   SL_NO   Subject  Marks Grade
0      1     Maths     98     O
1      4  Computer     96     O

In [10]:
dataDB['Marks'].mean()

88.33333333333333

In [11]:
dataDB.describe()

          SL_NO      Marks
count  6.000000   6.000000
mean   3.500000  88.333333
std    1.870829   7.229569
min    1.000000  80.000000
25%    2.250000  83.500000
50%    3.500000  86.500000
75%    4.750000  94.000000
max    6.000000  98.000000

In [12]:
dataDB['marks1']=dataDB['Marks']-10

In [13]:
dataDB

   SL_NO     Subject  Marks Grade  marks1
0      1       Maths     98     O      88
1      2     English     80     E      70
2      3       Hindi     88     E      78
3      4    Computer     96     O      86
4      5  Hist & Geo     83     E      73
5      6     Science     85     E      75

In [19]:
d1=dataDB.groupby('Grade')
d1.mean()

       SL_NO  Marks  marks1
Grade
E        4.0   84.0    74.0
O        2.5   97.0    87.0

In [30]:
def maxValue(s):
    
    is_max = s == s.max()
    
    return ['background-color:red' if v else '' for v in is_max]
dataDB.style.apply(maxValue)

### READING CSV

In [6]:
dataCSV=pd.read_csv('EmployeeCSVDATA.csv')

In [7]:
dataCSV

,Department,Total No of Employees,Percentage of Females,Percentage of Males
0,IT,840,45,55
1,Accounts,220,35,65
2,Production,900,23,77
3,HR,360,65,35
4,Marketing,450,44,56
5,Customer Service,540,40,60

In [23]:
dataCSV['Percentage of Females'].mean()

42.0

In [24]:
dataCSV['Percentage of Males'].mean()

58.0

In [25]:
dataCSV['Total percentage of employee']=dataCSV['Percentage of Females']+dataCSV['Percentage of Males']

In [26]:
dataCSV

,Department,Total No of Employees,Percentage of Females,Percentage of Males,Total percentage of employee
0,IT,840,45,55,100
1,Accounts,220,35,65,100
2,Production,900,23,77,100
3,HR,360,65,35,100
4,Marketing,450,44,56,100
5,Customer Service,540,40,60,100